package FitnessCalculator.FitnessCalculatorMaven;

import java.util.ArrayList;

/**
 * <b>Класс реализующий 2 абстрактных класса и их абстрактных методов</b>
 * @author Мовсесян Армен Саргисович
 * @version 1.0
 * В классе 2 абстрактных класса с абстрактными методами в каждом классе.
 * Классы используют библиотеку java.util.ArrayList.
 * 
 * Для использования двух абстрактных классов необходимо унаследоваться от этих классов.
 */

public class AbstractClasses {
	
	/**
	 * <b>Абстрактный класс реализующий абстрактные методы</b>
	 * @author Мовсесян Армен Саргисович
	 * @version 1.0
	 * В классе 5 абстрактных метода.
	 * Класс использует библиотеку java.util.ArrayList.
	 * 
	 * Для использования абстрактного класса необходимо унаследоваться от этих классов.
	 */
	public static abstract class abstractBodyMassIndex {
		/**
		 * Метод получения значения обозначающий рост человека
		 * @return значение типа double обозначающий рос человека
		 */
		public abstract double getHeight(); // рост человека
		/**
		 * Метод задания значения обозначающий рост человека
		 * @param variable - значение указывающий рос человека
		 */
		public abstract void setHeight(double variable); // рост человека
		/**
		 * Метод получения значения обозначающий вес человека
		 * @return значение типа double обозначающий вес человека
		 */
		public abstract double getWeight(); // вес человека
		/**
		 * Метод задания значения обозначающий вес человека
		 * @param variable - значение указывающий вес человека
		 */
		public abstract void setWeight(double variable); // вес человека
		
		/**
		 * Метод вычисляющий индекс массы тела человека
		 * @return массив из 2 элементов, первый элемент содекжит индекс массы тема человека в виде числа и второй элемент содержащий расшифровку 1 элемента словами. 
		 */
		public abstract ArrayList<String> BodyMassIndexResult(); // метод для определения индекса массы тела человека
	} 
	
	/**
	 * <b>Абстрактный класс реализующий абстрактные методы</b>
	 * @author Мовсесян Армен Саргисович
	 * @version 1.0
	 * В классе 3 абстрактных метода.
	 * Класс использует библиотеку java.util.ArrayList.
	 * 
	 * Для использования абстрактного класса необходимо унаследоваться от этих классов.
	 */
	public static abstract class abstractPulseZone {
		/**
		 * Метод получения значения обозначающий возраст человека
		 * @return значение типа int обозначающий возраст человека
		 */
		public abstract int getAge(); // возраст человека
		/**
		 * Метод задания значения обозначающий возраст человека
		 * @param variable - значение указывающий возрас человека
		 */
		public abstract void setAge(int variable); // возраст человека
		/**
		 * Метод вычисляющий шесть пульсовых зон человека 
		 * @return массив из 6 элементов,каждый обозначающий свой диапазон частоты сердечных сокращений человека. 
		 */
		public abstract ArrayList<String> PulseZoneResult(); // метод для определения пульсовых зон
	} 
}